src/KBhtorque_number_8.tex
% Created 2022-06-16 Thu 10:45
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{tikz}
\usepackage{cancel}
\usepackage{pgfplots}
\usepackage{indentfirst}
\setmainfont[ItalicFont = HelveticaNeue-Italic, BoldFont = HelveticaNeue-Bold, BoldItalicFont = HelveticaNeue-BoldItalic]{HelveticaNeue}
\newfontfamily\NHLight[ItalicFont = HelveticaNeue-LightItalic, BoldFont       = HelveticaNeue-UltraLight, BoldItalicFont = HelveticaNeue-UltraLightItalic]{HelveticaNeue-Light}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\usepackage{csquotes}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Written} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\renewcommand{\tableofcontents}{}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Houjun Liu}
\date{\today}
\title{Torque Number 8}
\hypersetup{
 pdfauthor={Houjun Liu},
 pdftitle={Torque Number 8},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.91 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Problem 5: Energy Approach}
\label{sec:org054d4a8}

\subsection{Velocity and Angular Velocity}
\label{sec:orgcb5e9e1}
Velocity at the top of the ramp: \(0\). Because there are no sliding (hence there are no heat), there is not going to be another component (beyond rotational, translational, and potential energy.)

We know, then:

\begin{equation}
   \Delta KE +\Delta PE = 0 
\end{equation}

From the fact that the object slid from the top of the ramp (\(h\)), we know that the sliding took a total potential energy loss of \(Mg\Delta h\). 

Therefore:

\begin{equation}
   -Mgh + \frac{1}{2} M{v_f}^2 + \frac{1}{2}I_o {\omega_f}^2 = 0
\end{equation}

Separating the variable off to both sides:

\begin{align}
    &\frac{1}{2} M{v_f}^2 + \frac{1}{2}I_o {\omega_f}^2 = Mgh\\
\Rightarrow & M{v_f}^2 + I_o {\omega_f}^2 = 2 Mgh
\end{align}

Because there are no sliding:

\begin{equation}
   {\omega_f} R = v_f
\end{equation}

We now have two equations and two variables:

\begin{equation}
   \begin{cases}
    M{v_f}^2 + I_o {\omega_f}^2 = 2 Mgh\\
   {\omega_f} R = v_f
\end{cases}
\end{equation}

Substituting the second result into the top expression:

\begin{equation}
   M{\omega_f}^2 R^2 + I_0{\omega_f}^2 = 2Mgh
\end{equation}

Finally, solving for \(\omega_f\):

\begin{align}
    &{\omega_f}^2(M R^2 + I_0) = 2Mgh\\
\Rightarrow &{\omega_f}^2 = \frac{2Mgh}{(M R^2 + I_0)}\\
\Rightarrow &{\omega_f} = \sqrt{\frac{2Mgh}{M R^2 + I_0}}\ \blacksquare
\end{align}

Multiplying the expression by \(R\) to figure \(v_f\):

\begin{equation}
v_f = R\sqrt{\frac{2Mgh}{M R^2 + I_0}}\ \blacksquare
\end{equation}

\subsection{Acceleration and Angular Acceleration}
\label{sec:orgfe031e1}
Taking the timed derivative of \(v_f\):

\begin{equation}
   a_{CM} = \frac{R}{2\sqrt{\frac{2Mg}{M R^2 + I_0}}} \frac{2Mgh}{M R^2 + I_0}} \frac{dh}{dt}
\end{equation}

to figure change in height, we see that, because of the ramp:

\begin{equation}
   \frac{dh}{dt} = \frac{d c}{dt} \sin\theta
\end{equation}

where \(c\) is the ramp remaining.

Furthermore, we see that:

\begin{equation}
   \frac{dc}{dt} = \vec{v}
\end{equation}

Hence:

\begin{equation}
 \frac{dh}{dt} =  R\sqrt{\frac{2Mgh}{M R^2 + I_0}}\sin\theta
\end{equation}

Substituting this back to the expression:

\begin{align}
   a_{CM} &= \frac{R}{2\sqrt{\frac{2Mgh}{M R^2 + I_0}}} \frac{2Mg}{M R^2 + I_0}  R\sqrt{\frac{2Mgh}{M R^2 + I_0}}\sin\theta\\
&= R^2  \frac{Mg}{M R^2 + I_0} \sin\theta\ \blacksquare
\end{align}

The same logic follows for \(\alpha\), simply without an extra constant of \(R\) being multiplied. To figure out its derivative, then we can again divide \(R\) out from the above expression to result in:

\begin{align}
   \alpha_{CM} &= R \frac{Mg}{M R^2 + I_0} \sin\theta\ \blacksquare
\end{align}

\section{Problem 6: Force and Torque}
\label{sec:org5abc2e0}

\subsection{Figuring Torque}
\label{sec:orge597245}
We will figure torque for the object, then use it for calculations. We will set the origin of the system to the lower-left of the triangle.

We will set the origin as being at the center of mass at the top of the ramp. Gravity and normal force, therefore, is coaxial with the center of mass in the world coordinate frame and hence not accounted for here.

We see that:

\begin{equation}
   I_0\alpha = -RF 
\end{equation}

Relating the slide down the ramp, by projecting the gravity vector onto the direction down the ramp; given that \(\theta\) is the vertical incline of the ramp, \(\sin\theta\) is the "horizontal" projection along the ramp:

\begin{equation}
Mg\sin\theta - F = Ma_x
\end{equation}

And finally, relating rotational and acceleration movements, given no sliding:

\begin{equation}
   a_x = R\alpha 
\end{equation}

We now have three expressions relating unknowns \(\alpha\), \(F\), and \(a_x\). Substituting both expressions into the second:

\begin{align}
   &F = \frac{I_0\alpha}{R} \\
\Rightarrow & Ma_x = Mg\sin\theta - \frac{I_0\alpha}{R} \\
\Rightarrow & MR\alpha = Mg\sin\theta - \frac{I_0\alpha}{R} \\
\Rightarrow & MR\alpha + \frac{I_0\alpha}{R}= Mg\sin\theta  \\
\Rightarrow & \alpha\left(MR + \frac{I_0}{R}\right)= Mg\sin\theta  \\
\Rightarrow & \alpha\left(\frac{MR^2+I_0}{R}\right)= Mg\sin\theta  \\
\Rightarrow & \alpha= Mg\sin\theta \left(\frac{R}{MR^2+I_0}\right) \\
\Rightarrow & \alpha= R\left\frac{Mg\sin\theta }{MR^2+I_0}\right\ \blacksquare
\end{align}

We can see that the expression derived here is now exactly the same as that found with energetic methods above.

We can figure \(a_{CM}\) by simply multiplying again the above expression with \(R\):

\begin{equation}
   a_{CM} = R^2\left\frac{Mg\sin\theta }{MR^2+I_0}\right\ \blacksquare
\end{equation}

\subsection{Time to reach bottom}
\label{sec:org64ada9e}
We can figure the time to reach bottom by integrating \(a_{CM}\) twice then solving for time.

\begin{equation}
   \iint R^2\left\frac{Mg\sin\theta }{MR^2+I_0}\right\ dt
\end{equation}

Now, we understand that the initial velocity and position of the object is \(0\). Hence:

\begin{equation}
   \iint R^2\left\frac{Mg\sin\theta }{MR^2+I_0}\right\ dt = R^2\left\frac{Mg\sin\theta }{MR^2+I_0}\right \frac{t^2}{2}
\end{equation}

To figure the time at the bottom of the ramp, we solve the above-derived expression for travel throughout the length of the ramp:

\begin{align}
    &\left\frac{R^2Mg\sin\theta }{MR^2+I_0}\right \frac{t^2}{2} = \frac{h}{\sin\theta} \\
\Rightarrow\ &t^2 = \frac{MR^2+I_0}{R^2Mg\sin\theta }\frac{2h}{\sin\theta} \\
\Rightarrow\ &t = \sqrt{\frac{MR^2+I_0}{R^2Mg\sin\theta }\frac{2h}{\sin\theta} }\\
\Rightarrow\ &t = \frac{1}{R\sin\theta} \sqrt{\frac{2h(MR^2+I_0)}{Mg}}\ \blacksquare
\end{align}

\subsection{Angular Velocity at the Bottom}
\label{sec:org6dbbe8e}
We can figure the angular velocity at the bottom by taking a single integral of the expression for angular acceleration, then supplying the right-derived expression for \(t\).

\begin{equation}
\int \alpha\ dt = \omega = tR\left\frac{Mg\sin\theta }{MR^2+I_0}\right
\end{equation}

Supplying the expression for \(t\) above herein:

\begin{align}
    \omega_f &= R\left(\frac{1}{R\sin\theta} \sqrt{\frac{2h(MR^2+I_0)}{Mg}}\right)\left\frac{Mg\sin\theta }{MR^2+I_0}\right\\
&= \sqrt{\frac{2h(MR^2+I_0)}{Mg}}\left\frac{Mg}{MR^2+I_0}\right\\
&= \sqrt{\frac{2h(MR^2+I_0)}{Mg}}\sqrt{\left(\frac{Mg}{MR^2+I_0}\right)^2}\\
&= \sqrt{\frac{2Mgh}{MR^2+I_0}}\ \blacksquare
\end{align}

We can see that this result agrees with that above.

\section{Foods for Thought}
\label{sec:orgfd4c8dc}
\begin{itemize}
\item The object is currently rolling perfectly; apart from counteracting slide, friction does not translate the point of contact (otherwise, it would be doing sliding) at all---hence doing no work.
\item The slope of the ramp, \(\theta\) is not in the expression for \(\omega_f\) --- meaning it has no influence on the final angular velocity.
\end{itemize}
\end{document}